from tables import Model

import numpy as np

#TODO: ValueError, RuntimeError/Warnings, ZeroDivision
#      должны быть исключены еще на моменте ввода данных,
#      поэтому надо написать свой обработчик исключений
#      на случаи неправильного ввода, пустых ячеек и т.п.

class Error():

    def __init__(self, tabModel: Model):

        self.tabModel = tabModel
        self.sys_error_message: str = ''
        self.mean_value: float = 0
        self.abs_err_value: float = 0
        self.rel_err_value: float = 0

        # Структура: t_student[n][alpha] = значение
        # n - число степеней свободы, alpha - доверительная вероятность
        self.t_student = {
            2: {0.2: 0.33, 0.4: 0.73, 0.5: 1.00, 0.6: 1.38, 0.7: 2.0,
                0.8: 3.1, 0.9: 6.3, 0.95: 12.7, 0.98: 31.8, 0.99: 63.7, 0.999: 636.6},

            3: {0.2: 0.29, 0.4: 0.62, 0.5: 0.82, 0.6: 1.06, 0.7: 1.3,
                0.8: 1.9, 0.9: 2.9, 0.95: 4.3, 0.98: 7.0, 0.99: 9.9, 0.999: 31.6},

            4: {0.2: 0.28, 0.4: 0.58, 0.5: 0.77, 0.6: 0.98, 0.7: 1.3,
                0.8: 1.6, 0.9: 2.4, 0.95: 3.2, 0.98: 4.5, 0.99: 5.8, 0.999: 12.9},

            5: {0.2: 0.27, 0.4: 0.57, 0.5: 0.74, 0.6: 0.94, 0.7: 1.2,
                0.8: 1.5, 0.9: 2.1, 0.95: 2.8, 0.98: 3.7, 0.99: 4.6, 0.999: 8.6},

            6: {0.2: 0.27, 0.4: 0.56, 0.5: 0.73, 0.6: 0.92, 0.7: 1.2,
                0.8: 1.5, 0.9: 2.0, 0.95: 2.6, 0.98: 3.4, 0.99: 4.0, 0.999: 6.9},

            7: {0.2: 0.26, 0.4: 0.55, 0.5: 0.71, 0.6: 0.90, 0.7: 1.1,
                0.8: 1.4, 0.9: 1.9, 0.95: 2.4, 0.98: 3.1, 0.99: 3.7, 0.999: 6.0},

            8: {0.2: 0.26, 0.4: 0.54, 0.5: 0.71, 0.6: 0.90, 0.7: 1.1,
                0.8: 1.4, 0.9: 1.9, 0.95: 2.4, 0.98: 3.0, 0.99: 3.5, 0.999: 5.4},

            9: {0.2: 0.26, 0.4: 0.54, 0.5: 0.71, 0.6: 0.90, 0.7: 1.1,
                0.8: 1.4, 0.9: 1.9, 0.95: 2.3, 0.98: 2.9, 0.99: 3.4, 0.999: 5.0},

            10: {0.2: 0.26, 0.4: 0.54, 0.5: 0.70, 0.6: 0.88, 0.7: 1.1,
                 0.8: 1.4, 0.9: 1.8, 0.95: 2.3, 0.98: 2.8, 0.99: 3.3, 0.999: 4.8},

            15: {0.2: 0.26, 0.4: 0.54, 0.5: 0.69, 0.6: 0.87, 0.7: 1.1,
                 0.8: 1.3, 0.9: 1.8, 0.95: 2.1, 0.98: 2.6, 0.99: 3.0, 0.999: 4.1},

            20: {0.2: 0.26, 0.4: 0.53, 0.5: 0.69, 0.6: 0.86, 0.7: 1.1,
                 0.8: 1.3, 0.9: 1.7, 0.95: 2.1, 0.98: 2.5, 0.99: 2.9, 0.999: 3.9},

            25: {0.2: 0.26, 0.4: 0.53, 0.5: 0.69, 0.6: 0.86, 0.7: 1.1,
                 0.8: 1.3, 0.9: 1.7, 0.95: 2.1, 0.98: 2.5, 0.99: 2.8, 0.999: 3.7},

            30: {0.2: 0.26, 0.4: 0.53, 0.5: 0.68, 0.6: 0.85, 0.7: 1.1,
                 0.8: 1.3, 0.9: 1.7, 0.95: 2.0, 0.98: 2.5, 0.99: 2.8, 0.999: 3.7},

            40: {0.2: 0.26, 0.4: 0.53, 0.5: 0.68, 0.6: 0.85, 0.7: 1.1,
                 0.8: 1.3, 0.9: 1.7, 0.95: 2.0, 0.98: 2.4, 0.99: 2.7, 0.999: 3.6},

            60: {0.2: 0.25, 0.4: 0.53, 0.5: 0.68, 0.6: 0.85, 0.7: 1.0,
                 0.8: 1.3, 0.9: 1.7, 0.95: 2.0, 0.98: 2.4, 0.99: 2.7, 0.999: 3.6},

            120: {0.2: 0.25, 0.4: 0.53, 0.5: 0.68, 0.6: 0.85, 0.7: 1.0,
                  0.8: 1.3, 0.9: 1.7, 0.95: 2.0, 0.98: 2.4, 0.99: 2.6, 0.999: 3.4},

            float('inf'): {0.2: 0.25, 0.4: 0.52, 0.5: 0.67, 0.6: 0.84, 0.7: 1.0,
                           0.8: 1.3, 0.9: 1.6, 0.95: 2.0, 0.98: 2.3, 0.99: 2.6, 0.999: 3.3}
        }


    def calculate(self):
        try:
            self.sys_error_message = ''
            self.data: np.ndarray = np.array(
                [float(self.tabModel.model.item(k, 1).text()) for k in range(self.tabModel.model.rowCount())])
            self.mean_value = self.get_mean()
            self.abs_err_value = self.get_standard_deviation()
            self.rel_err_value = self.get_relative_error()
        except Exception as e:
            print(e)
            self.sys_error_message = f'<html><body style="color: #D40D0D;"><p>Проверьте корректность ввода данных.</p><p>Ошибка: {e}</p></body></html>'


    def get_mean(self):
        return sum(self.data) / self.tabModel.model.rowCount()

    def get_standard_deviation(self):
        return np.std(self.data, ddof=1) / np.sqrt(len(self.data))

    def get_relative_error(self):
        return self.abs_err_value / self.mean_value

    def get_student_coefficient(self, n, alpha):
        return self.t_student[n][alpha]

